In [1]:
import pandas as pd
import numpy as np

apple_df = pd.DataFrame({"AAPL": [72.27, np.nan, 74.39, np.nan, 75.94, 76.93,np.nan, 78.74, np.nan, 79.81, np.nan, 79.53, np.nan, 79.56, 79.49]})

apple_df

     AAPL
0   72.27
1     NaN
2   74.39
3     NaN
4   75.94
5   76.93
6     NaN
7   78.74
8     NaN
9   79.81
10    NaN
11  79.53
12    NaN
13  79.56
14  79.49

In [2]:
apple_df.isnull()
apple_df.isnull().sum()

AAPL    6
dtype: int64

In [3]:
import pandas as pd
import numpy as np
daily_returns = pd.DataFrame({
    "AAPL": [0.5, np.nan, 0.62],
    "GOOG": [0.45, 0.63, 0.55]
})
daily_returns

   AAPL  GOOG
0  0.50  0.45
1   NaN  0.63
2  0.62  0.55

In [4]:
daily_returns.dropna()

   AAPL  GOOG
0  0.50  0.45
2  0.62  0.55

In [5]:
# Replace the NaNs with 0
daily_returns = daily_returns.fillna(0)
daily_returns

# Replace the NaNs with "Unknown"
daily_returns = daily_returns.fillna("Unknown")
daily_returns

   AAPL  GOOG
0  0.50  0.45
1  0.00  0.63
2  0.62  0.55

In [6]:
# Replace the NaNs with 0
daily_returns = daily_returns.fillna(0)
daily_returns

   AAPL  GOOG
0  0.50  0.45
1  0.00  0.63
2  0.62  0.55

In [7]:
# Replace the NaNs with the mean of the column
daily_returns = daily_returns.fillna(daily_returns.mean())
daily_returns

   AAPL  GOOG
0  0.50  0.45
1  0.00  0.63
2  0.62  0.55

In [8]:
import pandas as pd
best_actors_df = pd.DataFrame({
    "Best Actors": ["Nic Cage", "Nic Cage", "Harrison Ford"]
})
best_actors_df

best_actors_df.duplicated()

0    False
1     True
2    False
dtype: bool

In [9]:
best_actors_df.duplicated().sum()

1

In [10]:
best_actors_df=best_actors_df.drop_duplicates()
best_actors_df

     Best Actors
0       Nic Cage
2  Harrison Ford

In [11]:
import pandas as pd

prices = pd.DataFrame({
    "price_usd": ["$0.53", "$0.22", "0.34"]
})

prices

  price_usd
0     $0.53
1     $0.22
2      0.34

In [12]:
prices.dtypes

price_usd    object
dtype: object

In [13]:
prices.loc[:,"price_usd"] = prices.loc[:, "price_usd"].str.replace("$","", regex=True)
prices

  price_usd
0      0.53
1      0.22
2      0.34

In [14]:
prices.dtypes

price_usd    object
dtype: object

In [15]:
prices.loc[:,"price_usd"]=prices.loc[:,"price_usd"].astype("float")
prices.dtypes

price_usd    float64
dtype: object

In [16]:
# Create a DataFrame
aapl_returns = pd.DataFrame({"AAPL": [0.5, 0.56, 0.59, 0.52, 0.1]})

# Select the first row using iloc
aapl_returns.iloc[0]

AAPL    0.5
Name: 0, dtype: float64

In [17]:
aapl_returns.iloc[0:3]

   AAPL
0  0.50
1  0.56
2  0.59

In [18]:
aapl_returns = pd.DataFrame({"AAPL": [0.5, 0.56, 0.59, 0.52, 0.1, 0.75, 0.47]})

In [19]:
aapl_returns.iloc[-8:-1]

   AAPL
0  0.50
1  0.56
2  0.59
3  0.52
4  0.10
5  0.75

In [20]:
import numpy as np
revenue_df = pd.DataFrame(
    np.random.randint(low=1, high=1000, size=1000),
    index=pd.date_range('1/1/2017', periods=1000),
    columns=["revenue"])
revenue_df.tail()

            revenue
2019-09-23      801
2019-09-24      753
2019-09-25      264
2019-09-26      563
2019-09-27      125

In [21]:
# Select the last quarter of 2018 to the first quarter of 2019
revenue_df.loc['2018-10-01':'2019-03-31']

            revenue
2018-10-01      194
2018-10-02      515
2018-10-03       20
2018-10-04      819
2018-10-05      233
...             ...
2019-03-27      725
2019-03-28      734
2019-03-29      386
2019-03-30       95
2019-03-31      504

[182 rows x 1 columns]

In [22]:
# Describe the data by using summary statistics
revenue_df.loc['2018-10-01':'2019-03-31'].describe()

          revenue
count  182.000000
mean   502.631868
std    282.032151
min     11.000000
25%    271.250000
50%    485.000000
75%    739.500000
max    994.000000

In [23]:
sales_df["quantity"] > 10

NameError: name 'sales_df' is not defined